HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/Ifx_reg.h
/**
 * \File Ifx_reg.h
 * \brief
 * Version: TC35XA_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 */


#ifndef IFX_REG_H
#define IFX_REG_H 1

#include "IfxAgbt_reg.h"
#include "IfxAsclin_reg.h"
#include "IfxCan_reg.h"
#include "IfxCbs_reg.h"
#include "IfxCcu6_reg.h"
#include "IfxConverter_reg.h"
#include "IfxCpu_reg.h"
#include "IfxDma_reg.h"
#include "IfxDmu_reg.h"
#include "IfxDom_reg.h"
#include "IfxEbcu_reg.h"
#include "IfxEmem_mpu_reg.h"
#include "IfxEmem_reg.h"
#include "IfxEray_reg.h"
#include "IfxEvadc_reg.h"
#include "IfxFce_reg.h"
#include "IfxFsi_reg.h"
#include "IfxGeth_reg.h"
#include "IfxGpt12_reg.h"
#include "IfxHsm_reg.h"
#include "IfxHspdm_reg.h"
#include "IfxI2c_reg.h"
#include "IfxInt_reg.h"
#include "IfxIom_reg.h"
#include "IfxLmu_reg.h"
#include "IfxMcdslight_reg.h"
#include "IfxMtu_reg.h"
#include "IfxPfi_reg.h"
#include "IfxPms_reg.h"
#include "IfxPmu_reg.h"
#include "IfxPort_reg.h"
#include "IfxQspi_reg.h"
#include "IfxRif_reg.h"
#include "IfxSbcu_reg.h"
#include "IfxScu_reg.h"
#include "IfxSmu_reg.h"
#include "IfxSpu_reg.h"
#include "IfxSpulckstp_reg.h"
#include "IfxSrc_reg.h"
#include "IfxStm_reg.h"

#endif /*IFX_REG_H*/
